src/DataProcessors/РабочийСтол/РабочийСтол.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочийСтол</name>
</mdclass:DataProcessor>

src/Enums/ВидВложения/ВидВложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидВложения</name>
  <enumValues>
    <name>НакладнаяСчет</name>
  </enumValues>
  <enumValues>
    <name>СертификатПротокол</name>
  </enumValues>
  <enumValues>
    <name>Прайс</name>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/РабочийСтол/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.НакладнаяСчет" ) );	
	
КонецПроцедуры

&НаСервере
Процедура установитьПараметрыСписка ( Значение )
	
	настройки = Новый НастройкиКомпоновкиДанных ();
	отбор = настройки.Отбор.Элементы.Добавить ( Тип ( "ЭлементОтбораКомпоновкиДанных" ) ); 
	отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных ( "ВидВложения" );
	отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	отбор.Использование = Истина;
	отбор.ПравоеЗначение = Значение;
	Список.КомпоновщикНастроек.ЗагрузитьНастройки ( настройки );
	Элементы.Список.Обновить ();
			
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНакладныеСчета ( Команда )
	
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.НакладнаяСчет" ) );

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрайсы ( Команда )
	
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.Прайс" ) );
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСертификатыПротоколы ( Команда )
	
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.СертификатПротокол" ) );
	
КонецПроцедуры
